Revit 2027 API
BuiltInFailures.FamilyFailures.TitleblockBadViewType Property
 Titleblocks can only be placed on sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TitleblockBadViewType { get; }
Public Shared ReadOnly Property TitleblockBadViewType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TitleblockBadViewType {
	FailureDefinitionId^ get ();
}
static member TitleblockBadViewType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace